import React from "react";
import Header from "../components/header";
import Footer from "../components/footer";
import MyTitle from "../components/title";
import { useRouter } from "next/router";
import {
  AcademicCapIcon,
  HeartIcon,
  RocketIcon,
  ComputerIcon,
} from "../assets/icons";
import MetaHead from "../components/metaHead";

const programs = [
  [
    {
      labels: ["Бага ангийн", "хөтөлбөр"],
      id: "elementary",
      program: [
        {
          label: "Ерөнхий боловсролын баяжуулсан хөтөлбөр",
          items: [
            "Боловсрол, Шинжлэх ухааны яамнаас гаргасан ЕБС-ийн баяжуулсан хөтөлбөр",
            "Хүмүүжүүлэх, хүүхдийн авьяас чадварыг бага наснаас нь нээн илрүүлэх зорилго бүхий EQ хичээлүүд",
            "Эрүүл амьдралын дадал хэвшүүлэх цогц хөтөлбөр",
            "Гадаад багштай англи хэлний хичээл",
            "Сэтгэл судлалд суурилсан сурах арга барилыг дэмжих аргачлал",
            "Тоглоомын аргаар заах, мэдээллийн технологийн суурь хичээл",
            "Цахим сургалтын бэлэн байдал, хүүхэд бүрт зориулсан цахим хичээлийн хэрэгслээр хангана",
          ],
        },
        {
          label: "Нэмэлт хөтөлбөр",
          items: [
            "Үкүлэлэ хөгжим",
            "IQ",
            "Чөлөөт бүжиг",
            "Спорт өрөлт",
            "Шатар",
            "Хөл бөмбөг",
          ],
        },
      ],
    },
    {
      labels: ["Дунд ангийн", "хөтөлбөр"],
      id: "secondary",
      program: [
        {
          label: "Ерөнхий боловсролын баяжуулсан хөтөлбөр",
          items: [
            "Хүмүүжүүлэх, хүүхдийн авьяас чадварыг нээн илрүүлэх зорилго бүхий EQ хичээлүүд",
            "Эрүүл амьдралын дадал хэвшүүлэх цогц хөтөлбөр",
            "Гадаад багштай англи хэлний хичээл",
            "Математик, англи хэлний түвшинчилсэн сургалт",
            "Төсөлд суурилсан байгалийн ухааны болон нийгмийн ухааны хичээлүүд",
          ],
        },
        {
          label: "Mэдээллийн технологийн хөтөлбөр",
          items: [
            "Мэдээллийн технологийн гүнзгийрүүлсэн сургалт",
            "IOT-ын суурь хөтөлбөр",
            "Электроникийн суурь мэдлэг олгох хичээл",
            "Программ хангамж, электроник ба гурван хэмжээст хэвлэлийг хослуулж бүтээл гаргана",
            "Хиймэл оюун ухаан Machine learning төслүүдийг сурагчид гүйцэтгэнэ",
          ],
        },
        {
          label: "Нэмэлт хөтөлбөр",
          items: [
            "Кино клуб",
            "Ярианы чадвар дэмжих клуб",
            "Бийрийн бичлэг",
            "Монгол бүжиг",
            "Сагсан бөмбөг",
            "Гар бөмбөг",
            "Нэст брэнд",
            "Комикийн клуб",
            "Бясалгал",
            "Илтгэх урлаг",
            "IoT дугуйлан",
          ],
        },
        {
          label: "Фитнес - эрүүл чийрэг бие",
          items: [
            "Сурагч бүрийн биеийн онцлогт тохирсон чийрэгжүүлэх хөтөлбөр",
            "Спорт тоглоом болон Calisthenic зал",
            "Эрүүл мэндийн урьдчилан сэргийлэх үзлэг, эрүүл мэндийн дэвтэр",
          ],
        },
      ],
    },
    {
      labels: ["Ахлах ангийн", "хөтөлбөр"],
      id: "high",
      program: [
        {
          label: "Ерөнхий боловсролын баяжуулсан хөтөлбөр",
          items: [
            "Нийгмийн болон Байгалийн ухааны хичээлийг сонгон судлах өргөн боломж",
            "Эрүүл амьдралын дадал хэвшүүлэх цогц хөтөлбөр",
            "Гадаад багштай англи хэлний хичээл",
            "Математик, англи хэлний түвшинчилсэн сургалт",
          ],
        },
        {
          label: "Mэдээллийн технологийн хөтөлбөр",
          items: [
            "Олон улсын жишигт нийцсэн мэдээллийн технологийн 1200+ цагийн цогц хөтөлбөр",
            "Монголын тэргүүлэх компаниудад дадлага хийх, дэлхийн томоохон компаниудтай танилцах хөтөлбөр",
            "Олон улсын зөвлөх баг",
          ],
        },
        {
          label: "Нэмэлт хөтөлбөр",
          items: [
            "Мэтгэлцээн",
            "Дууны хэлэлцүүлэг",
            "Япон хэл, соёлын дугуйлан",
            "Рубик шоо",
            "Улаан загалмай",
            "Photoshop буюу дизайны дугуйлан",
            "Ширээний теннис",
            "Номын хэлэлцүүлэг",
          ],
        },
        {
          label: "Фитнес - эрүүл чийрэг бие",
          items: [
            "Сурагч бүрийн биеийн онцлогт тохирсон чийрэгжүүлэх хөтөлбөр",
            "Спорт тоглоом болон Calisthenic зал",
            "Эрүүл мэндийн урьдчилан сэргийлэх үзлэг, эрүүл мэндийн дэвтэр",
          ],
        },
      ],
    },
  ],
  [
    {
      labels: ["Elementary School", "Programs"],
      id: "elementary",
      program: [
        {
          label: "Ерөнхий боловсролын баяжуулсан хөтөлбөр",
          items: [
            "Боловсрол, Шинжлэх ухааны яамнаас гаргасан ЕБС-ийн баяжуулсан хөтөлбөр",
            "Хүмүүжүүлэх, хүүхдийн авьяас чадварыг бага наснаас нь нээн илрүүлэх зорилго бүхий EQ хичээлүүд",
            "Эрүүл амьдралын дадал хэвшүүлэх цогц хөтөлбөр",
            "Гадаад багштай англи хэлний хичээл",
            "Сэтгэл судлалд суурилсан сурах арга барилыг дэмжих аргачлал",
            "Тоглоомын аргаар заах, мэдээллийн технологийн суурь хичээл",
            "Цахим сургалтын бэлэн байдал, хүүхэд бүрт зориулсан цахим хичээлийн хэрэгслээр хангана",
          ],
        },
        {
          label: "Нэмэлт хөтөлбөр",
          items: [
            "Үкүлэлэ хөгжим",
            "IQ",
            "Чөлөөт бүжиг",
            "Спорт өрөлт",
            "Шатар",
            "Хөл бөмбөг",
          ],
        },
      ],
    },
    {
      labels: ["Secondary School", "Programs"],
      id: "secondary",
      program: [
        {
          label: "Ерөнхий боловсролын баяжуулсан хөтөлбөр",
          items: [
            "Хүмүүжүүлэх, хүүхдийн авьяас чадварыг нээн илрүүлэх зорилго бүхий EQ хичээлүүд",
            "Эрүүл амьдралын дадал хэвшүүлэх цогц хөтөлбөр",
            "Гадаад багштай англи хэлний хичээл",
            "Математик, англи хэлний түвшинчилсэн сургалт",
            "Төсөлд суурилсан байгалийн ухааны болон нийгмийн ухааны хичээлүүд",
          ],
        },
        {
          label: "Mэдээллийн технологийн хөтөлбөр",
          items: [
            "Мэдээллийн технологийн гүнзгийрүүлсэн сургалт",
            "IOT-ын суурь хөтөлбөр",
            "Электроникийн суурь мэдлэг олгох хичээл",
            "Программ хангамж, электроник ба гурван хэмжээст хэвлэлийг хослуулж бүтээл гаргана",
            "Хиймэл оюун ухаан Machine learning төслүүдийг сурагчид гүйцэтгэнэ",
          ],
        },
        {
          label: "Нэмэлт хөтөлбөр",
          items: [
            "Кино клуб",
            "Ярианы чадвар дэмжих клуб",
            "Бийрийн бичлэг",
            "Монгол бүжиг",
            "Сагсан бөмбөг",
            "Гар бөмбөг",
            "Нэст брэнд",
            "Комикийн клуб",
            "Бясалгал",
            "Илтгэх урлаг",
            "IoT дугуйлан",
          ],
        },
        {
          label: "Фитнес - эрүүл чийрэг бие",
          items: [
            "Сурагч бүрийн биеийн онцлогт тохирсон чийрэгжүүлэх хөтөлбөр",
            "Спорт тоглоом болон Calisthenic зал",
            "Эрүүл мэндийн урьдчилан сэргийлэх үзлэг, эрүүл мэндийн дэвтэр",
          ],
        },
      ],
    },
    {
      labels: ["High School", "Programs"],
      id: "high",
      program: [
        {
          label: "Enriched General Education Program",
          items: [
            "Нийгмийн болон Байгалийн ухааны хичээлийг сонгон судлах өргөн боломж",
            "Эрүүл амьдралын дадал хэвшүүлэх цогц хөтөлбөр",
            "Гадаад багштай англи хэлний хичээл",
            "Математик, англи хэлний түвшинчилсэн сургалт",
          ],
        },
        {
          label: "Mэдээллийн технологийн хөтөлбөр",
          items: [
            "Олон улсын жишигт нийцсэн мэдээллийн технологийн 1200+ цагийн цогц хөтөлбөр",
            "Монголын тэргүүлэх компаниудад дадлага хийх, дэлхийн томоохон компаниудтай танилцах хөтөлбөр",
            "Олон улсын зөвлөх баг",
          ],
        },
        {
          label: "Нэмэлт хөтөлбөр",
          items: [
            "Мэтгэлцээн",
            "Дууны хэлэлцүүлэг",
            "Япон хэл, соёлын дугуйлан",
            "Рубик шоо",
            "Улаан загалмай",
            "Photoshop буюу дизайны дугуйлан",
            "Ширээний теннис",
            "Номын хэлэлцүүлэг",
          ],
        },
        {
          label: "Фитнес - эрүүл чийрэг бие",
          items: [
            "Сурагч бүрийн биеийн онцлогт тохирсон чийрэгжүүлэх хөтөлбөр",
            "Спорт тоглоом болон Calisthenic зал",
            "Эрүүл мэндийн урьдчилан сэргийлэх үзлэг, эрүүл мэндийн дэвтэр",
          ],
        },
      ],
    },
  ],
];

const colors = ["green", "pink", "blue"];

const icons = [
  { icon: <AcademicCapIcon /> },
  { icon: <ComputerIcon /> },
  { icon: <RocketIcon /> },
  { icon: <HeartIcon /> },
];

const Programs = () => {
  const router = useRouter();
  const locale = router.locale === "en" ? "1" : "0";
  return (
    <div className="relative overflow-hidden">
      <MetaHead title="Сургалтын Хөтөлбөр | " />
      <Header />
      <div className="w-full responsive-padding">
        {programs[locale].map((row, index) => (
          <div key={index} className="flex flex-col py-20" id={row.id}>
            <MyTitle
              row1={row.labels[0]}
              row2={row.labels[1]}
              color={colors[index]}
            />
            <div className="grid md:grid-cols-2 gap-10">
              {row.program.map((r, i) => (
                <div
                  key={i}
                  className="bg-gradient-to-b from-white/0 to-white/5 p-8 border border-white/10 backdrop-blur-sm rounded-2xl relative overflow-hidden cursor-pointer hover:from-white/5 hover:to-white/5 group  hover-transition"
                >
                  <div className="text-2xl font-bold mb-4">{r.label}</div>
                  <div className="flex flex-col">
                    {r.items.map((r1, i1) => (
                      <span
                        className="md:w-3/4 font-light text-white/80 leading-8"
                        key={i1}
                      >
                        - {r1}
                      </span>
                    ))}
                  </div>
                  <div
                    className={`absolute group-hover:scale-[900%] hover-transition scale-[800%] right-12 bottom-12 opacity-[3%]`}
                  >
                    {icons[i].icon}
                  </div>
                </div>
              ))}
            </div>
          </div>
        ))}
      </div>
      <Footer />
      <div className="fixed md:w-1/2 w-3/4 rounded-full aspect-square md:blur-[20rem] blur-[4rem] bg-gradient-to-b from-blue md:opacity-[40%] opacity-20 md:-right-1/4 -z-10 top-0 -right-1/4 md:scale-100 scale-[150%]"></div>
      <div className="fixed md:w-1/2 w-full rounded-full aspect-square md:blur-[20rem] blur-[4rem] bg-gradient-to-b from-pink  md:opacity-[30%] opacity-[20%]  md:-left-1/4 md:top-[15%] top-[70%] md:scale-100 scale-[150%] -left-1/2 -z-20"></div>
    </div>
  );
};

export default Programs;
